{
  "code": "3000",
  "has_policy": true,
  "has_regulation": false,
  "policy": {
    "code": "3000",
    "title": "Concepts And Roles",
    "type": "Policy",
    "last_reviewed": "11/04/2009",
    "file_path": "data/extracted/policies/3000.txt"
  },
  "regulation": null,
  "compliance": {
    "issues": [
      {
        "priority": "MATERIAL",
        "confidence": 85,
        "title": "Missing Administrative Regulation for Business Operations Implementation",
        "description": "While the Board Policy establishes the framework for business and noninstructional operations, there is no corresponding Administrative Regulation to provide specific implementation procedures. California Education Code requires districts to have detailed procedures for budget development, fiscal management, risk management programs, and financial reporting processes.",
        "missing_from": "AR",
        "legal_citations": [
          {
            "citation": "Education Code Section 42127",
            "text": "The governing board of each school district shall adopt policies and procedures for the development of the annual budget that include opportunities for public input."
          }
        ],
        "required_language": "Administrative procedures detailing: (1) Specific budget development timeline and process, (2) Public input procedures and notification requirements, (3) Risk management program implementation steps, (4) Financial reporting procedures and deadlines, (5) Audit facilitation processes, (6) Fiscal monitoring and accountability measures.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MATERIAL",
        "confidence": 90,
        "title": "Missing Specific Public Input Requirements for Budget Process",
        "description": "The policy mentions \"opportunities for public input\" but lacks specific requirements for public hearings, notice periods, and community engagement procedures required by California Education Code for budget adoption.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Education Code Section 42103",
            "text": "The governing board shall hold a public hearing on the proposed budget prior to adoption. Notice of the time and place of hearing shall be posted in three public places in the district at least 72 hours before the hearing."
          }
        ],
        "required_language": "The district shall conduct public hearings on the proposed budget with at least 72 hours advance notice posted in three public places within the district. The hearing shall provide opportunity for public comment before budget adoption.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MATERIAL",
        "confidence": 95,
        "title": "Missing Budget Adoption Timeline Requirements",
        "description": "The policy lacks specific statutory deadlines for budget adoption and submission to the county office of education, which are mandatory under California Education Code.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Education Code Section 42127(a)",
            "text": "On or before July 1, the governing board of each school district shall hold a public hearing on and adopt a budget for the subsequent fiscal year."
          }
        ],
        "required_language": "The Board shall adopt the annual budget on or before July 1 for the subsequent fiscal year. The adopted budget shall be submitted to the county superintendent of schools by July 1.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MATERIAL",
        "confidence": 80,
        "title": "Missing Independent Audit Requirements Detail",
        "description": "While the policy mentions facilitating the independent audit process, it lacks specific requirements for annual independent audits mandated by California Education Code, including audit committee responsibilities and reporting requirements.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Education Code Section 41020",
            "text": "The governing board of each school district shall provide for an annual independent audit of the financial statements of the school district to be conducted by a certified public accountant."
          }
        ],
        "required_language": "The district shall provide for an annual independent audit of financial statements conducted by a certified public accountant. The audit shall be completed and submitted to appropriate agencies within required timeframes.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MINOR",
        "confidence": 70,
        "title": "Outdated Policy Review Date",
        "description": "The policy was last reviewed in 2009, which is over 14 years ago. Regular policy review ensures compliance with current legal requirements and best practices.",
        "missing_from": "BP",
        "legal_citations": [
          {
            "citation": "Education Code Section 35160",
            "text": "The governing board of any school district may initiate and carry on any program, activity, or may otherwise act in any manner which is not in conflict with or inconsistent with any law and which is not in conflict with the purposes for which school districts are established."
          }
        ],
        "required_language": "Regular review and update of policy to ensure continued compliance with current legal requirements.",
        "recommended_placement": "BP"
      }
    ]
  },
  "check_date": "2025-06-01T13:24:05.182091+00:00"
}