{
  "code": "3100",
  "has_policy": true,
  "has_regulation": true,
  "policy": {
    "code": "3100",
    "title": "Budget",
    "type": "Policy",
    "last_reviewed": "11/04/2009",
    "file_path": "data/extracted/policies/3100.txt"
  },
  "regulation": {
    "code": "3100",
    "title": "Budget",
    "type": "Regulation",
    "last_reviewed": "11/04/2009",
    "file_path": "data/extracted/regulations/3100.txt"
  },
  "compliance": {
    "issues": [
      {
        "priority": "MATERIAL",
        "confidence": 85,
        "title": "Missing Budget Transparency Requirements",
        "description": "California requires specific budget transparency measures including posting budget documents online and providing detailed financial information in accessible formats. The policy and regulation lack requirements for online posting, website accessibility, and standardized financial reporting formats required for public transparency.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Government Code 53087.8",
            "text": "Local agencies shall make available on their Internet Web sites their current budget and the prior year's budget, and shall present budget information in a format that allows the public to easily identify and understand the agency's budget priorities."
          }
        ],
        "required_language": "The district shall post its current adopted budget and the prior year's budget on the district's website in a format that allows the public to easily identify and understand the district's budget priorities. Budget documents shall remain accessible online throughout the fiscal year.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MATERIAL",
        "confidence": 90,
        "title": "Missing Interim Financial Reporting Requirements",
        "description": "Education Code requires districts to file interim financial reports with specific certification levels. The policy mentions budget amendments but lacks the mandatory interim reporting requirements and certification procedures required by state law.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Education Code 42130-42131",
            "text": "The governing board shall file interim financial reports with the county superintendent of schools that show the district's financial position and that include a certification by the district's chief business official and superintendent regarding the district's ability to meet its financial obligations."
          }
        ],
        "required_language": "The Superintendent or designee shall prepare and file interim financial reports as of October 31 and January 31 with the County Superintendent of Schools. Each report shall include certification by the district's chief business official and superintendent regarding the district's ability to meet its financial obligations for the remainder of the fiscal year and the subsequent fiscal year.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MATERIAL",
        "confidence": 95,
        "title": "Missing Unaudited Actuals Reporting Requirement",
        "description": "Districts are required by law to file unaudited actual financial reports by specific deadlines. This critical reporting requirement is completely absent from both the policy and regulation.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Education Code 42100",
            "text": "On or before September 15, the governing board of each school district shall file with the county superintendent of schools a report of the unaudited actual receipts and expenditures of the district for the preceding fiscal year."
          }
        ],
        "required_language": "The Superintendent or designee shall prepare and file with the County Superintendent of Schools a report of unaudited actual receipts and expenditures for the preceding fiscal year no later than September 15.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MINOR",
        "confidence": 75,
        "title": "Incomplete Reserve Policy Language",
        "description": "While the policy establishes a 6% reserve requirement, it lacks specific language about the purpose and use restrictions of reserves as recommended by state guidance, though this is not strictly legally mandated.",
        "missing_from": "BP",
        "legal_citations": [
          {
            "citation": "Education Code 42127.01",
            "text": "The adopted budget shall include a reserve for economic uncertainties to address unforeseen circumstances that may affect the district's fiscal condition."
          }
        ],
        "required_language": "The general fund reserve for economic uncertainty shall be maintained to address unforeseen circumstances that may affect the district's fiscal condition and shall not be used for ongoing operational expenses except in cases of fiscal emergency.",
        "recommended_placement": "BP"
      }
    ]
  },
  "check_date": "2025-06-01T13:24:10.382318+00:00"
}