{
  "code": "3230",
  "has_policy": true,
  "has_regulation": true,
  "policy": {
    "code": "3230",
    "title": "Federal Grant Funds",
    "type": "Policy",
    "last_reviewed": "06/30/2021",
    "file_path": "data/extracted/policies/3230.txt"
  },
  "regulation": {
    "code": "3230",
    "title": "Federal Grant Funds",
    "type": "Regulation",
    "last_reviewed": "06/30/2021",
    "file_path": "data/extracted/regulations/3230.txt"
  },
  "compliance": {
    "error": "Parse error: not well-formed (invalid token): line 48, column 59",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Equipment Management and Disposition Requirements</title>\n            <description>While the BP mentions that equipment purchased with federal funds shall be \"properly inventoried and adequately maintained,\" neither document contains the comprehensive equipment management requirements mandated by federal regulations, including specific inventory procedures, use restrictions, disposition requirements, and federal interest thresholds.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>2 CFR 200.313 - Equipment</citation>\n                    <text>Requirements for equipment records, use restrictions, management requirements, and disposition procedures for equipment acquired with federal funds, including federal interest thresholds and approval requirements for disposition.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Equipment management procedures including: (1) property records with description, serial number, source, acquisition date, cost, location, use and condition; (2) physical inventory every two years with reconciliation; (3) control system to prevent loss, damage, or theft; (4) maintenance procedures; (5) use restrictions ensuring equipment serves federal award purposes; (6) disposition procedures requiring federal agency approval when federal interest exceeds $5,000; and (7) proper compensation to federal government upon disposition.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Subrecipient Monitoring Requirements</title>\n            <description>Neither document addresses the district's responsibilities when acting as a pass-through entity to subrecipients, including pre-award evaluation, award identification requirements, and ongoing monitoring obligations.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>2 CFR 200.331 - Requirements for pass-through entities</citation>\n                    <text>Pass-through entities must evaluate subrecipients' risk, clearly identify federal awards, monitor subrecipient activities, and ensure subrecipient compliance with federal requirements.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>When the district acts as a pass-through entity, it shall: (1) evaluate each subrecipient's risk of noncompliance; (2) clearly identify federal award information to subrecipients; (3) monitor subrecipient activities to ensure compliance; (4) verify subrecipients are audited as required; and (5) take enforcement action against noncompliant subrecipients as necessary.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"80\">\n            <title>Incomplete Indirect Cost Requirements</title>\n            <description>While the AR mentions determining direct vs. indirect costs, neither document addresses the specific requirements for indirect cost rates, including the option to use the 10% de minimis rate or the requirement to negotiate rates with the federal government.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>2 CFR 200.414 - Indirect (F&A) costs</citation>\n                    <text>Requirements for indirect cost rate proposals, negotiations, and the option to use a 10% de minimis rate for entities without negotiated indirect cost rates.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district may either: (1) use a de minimis rate of 10% of modified total direct costs for indirect costs if it has never received a negotiated indirect cost rate; or (2) develop and submit an indirect cost rate proposal for negotiation with the federal government. Indirect costs must be allocated in accordance with the district's approved indirect cost rate or the de minimis rate.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"75\">\n            <title>Missing Closeout Procedures</title>\n            <description>Neither document specifically addresses federal award closeout procedures, including final reporting requirements and the timeline for closeout activities.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>2 CFR 200.343 - Closeout</citation>\n                    <text>Requirements for federal award closeout, including submission of final reports and completion of closeout within specified timeframes.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district shall complete closeout of federal awards within 120 calendar days after the end of the period of performance, including submission of all required final reports and resolution of any audit findings or other issues.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"70\">\n            <title>Missing Remedies for Noncompliance</title>\n            <description>Neither document addresses the potential remedies that federal agencies may impose for noncompliance, such as temporary withholding of payments or termination of awards.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>2 CFR 200.338 - Remedies for noncompliance</citation>\n                    <text>Federal agencies may impose remedies for noncompliance including temporary withholding of cash payments, disallowance of costs, suspension or termination of the award, and other remedies.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district acknowledges that federal agencies may impose remedies for noncompliance including temporary withholding of payments, disallowance of costs, suspension or termination of awards, withholding of further awards, and other remedies as legally available.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T13:24:34.947601+00:00"
}