{
  "code": "3430",
  "has_policy": true,
  "has_regulation": true,
  "policy": {
    "code": "3430",
    "title": "Investing",
    "type": "Policy",
    "last_reviewed": "11/04/2009",
    "file_path": "data/extracted/policies/3430.txt"
  },
  "regulation": {
    "code": "3430",
    "title": "Investing",
    "type": "Regulation",
    "last_reviewed": "11/04/2009",
    "file_path": "data/extracted/regulations/3430.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 609",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"95\">\n            <title>Missing Authorized Investment Types</title>\n            <description>The policy states funds \"may be invested as allowed by law for public funds\" but fails to specify the actual authorized investment types. Government Code requires districts to explicitly list permissible investments in their investment policy to ensure compliance and provide clear guidance to investment officers.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code 53601</citation>\n                    <text>A local agency may invest in the following: (a) Securities of the United States, (b) Securities of any agency of the United States, (c) Bankers' acceptances, (d) Commercial paper, (e) Negotiable certificates of deposit, (f) Repurchase agreements, (g) Reverse repurchase agreements, (h) Medium-term notes, (i) Shares of beneficial interest issued by diversified management companies, (j) Moneys held by a trustee or fiscal agent, (k) County investment pools, (l) Joint powers authority pools, (m) Voluntary investment program with the state treasurer, (n) Supranational obligations.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district may invest surplus funds only in the following authorized investments as permitted by Government Code 53601: (a) Securities of the United States; (b) Securities of any agency of the United States; (c) Bankers' acceptances; (d) Commercial paper; (e) Negotiable certificates of deposit; (f) Repurchase agreements; (g) Reverse repurchase agreements; (h) Medium-term notes; (i) Shares of beneficial interest issued by diversified management companies; (j) Moneys held by a trustee or fiscal agent; (k) County investment pools; (l) Joint powers authority pools; (m) Voluntary investment program with the state treasurer; (n) Supranational obligations. Each investment type shall comply with the specific requirements and limitations set forth in Government Code 53601 et seq.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Investment Limitations and Restrictions</title>\n            <description>The policy lacks specific percentage limitations, maturity restrictions, and credit quality requirements for different investment types as mandated by Government Code. These limitations are essential for legal compliance and risk management.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code 53601-53609</citation>\n                    <text>Various sections specify maximum percentages, maturity limits, and credit requirements. For example, commercial paper is limited to 25% of portfolio and 270 days maturity; medium-term notes limited to 30% of portfolio and 5 years maturity; negotiable CDs limited to 30% of portfolio.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>All investments shall comply with the percentage limitations, maturity restrictions, and credit quality requirements specified in Government Code 53601 et seq., including but not limited to: maximum maturity of five years unless specifically authorized by the Board; commercial paper limited to 25% of portfolio with maximum 270-day maturity; medium-term notes limited to 30% of portfolio with maximum 5-year maturity; and other restrictions as specified by law.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Prohibited Investment Statement</title>\n            <description>The policy does not explicitly state that investments not specifically authorized are prohibited, which is required to ensure compliance with Government Code restrictions on public agency investments.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code 53601.6</citation>\n                    <text>A local agency may not invest any funds covered by this chapter in any types of investments not specifically authorized by this chapter.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district shall not invest in any investment type not specifically authorized by Government Code 53601 et seq. Any investment not explicitly listed as authorized is prohibited.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Investment Officer Training Requirements</title>\n            <description>The policy fails to address the mandatory training requirements for investment officers as required by Government Code, which is essential for ensuring qualified personnel manage district investments.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code 53607</citation>\n                    <text>The person authorized to make investment decisions on behalf of a local agency shall annually complete a minimum of 10 hours of continuing education in subjects related to investment practices.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The chief fiscal officer or other person authorized to make investment decisions shall complete a minimum of 10 hours annually of continuing education in subjects related to investment practices, including but not limited to: general economic conditions, investment risk management, and applicable legal requirements.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"75\">\n            <title>Incomplete Quarterly Report Distribution</title>\n            <description>The policy mentions quarterly reports for investments $25,000 or more but doesn't specify all required recipients. The regulation covers general quarterly reports but could be clearer about the specific threshold reporting.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code 53646</citation>\n                    <text>The treasurer or other official shall render to the legislative body and chief executive officer a quarterly investment report.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>For individual investment accounts of $25,000 or more, separate quarterly reports shall be provided to the Board, Superintendent, and internal auditor detailing the specific investments in those accounts.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T13:26:30.915983+00:00"
}