{
  "code": "3541",
  "has_policy": false,
  "has_regulation": true,
  "policy": null,
  "regulation": {
    "code": "3541",
    "title": "Transportation Routes And Services",
    "type": "Regulation",
    "last_reviewed": "11/04/2009",
    "file_path": "data/extracted/regulations/3541.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 320",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"95\">\n            <title>Missing Board Policy Document</title>\n            <description>The Board Policy (BP) 3541 document is entirely missing. California school districts are required to have board policies that establish the governance framework and board direction for transportation services. The administrative regulation alone cannot fulfill all legal requirements, as policies typically contain board-level decisions, rights notifications, and high-level directives that regulations cannot provide.</description>\n            <missing_from>BP</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 35160</citation>\n                    <text>The governing board of a school district may initiate and carry on any program, activity, or may otherwise act in any manner which is not in conflict with or inconsistent with, or preempted by, any law and which is not in conflict with the purposes for which school districts are established.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>A comprehensive Board Policy 3541 should be created to establish board governance over transportation services, including policy statements on transportation philosophy, board authorization requirements, and high-level directives that complement the existing administrative regulation.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Homeless Student Transportation Specifics</title>\n            <description>While the regulation mentions providing transportation to homeless children \"in accordance with law,\" it lacks the specific requirements mandated by the McKinney-Vento Act. The regulation must specify transportation to school of origin and immediate enrollment rights.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>42 USC 11432(g)(1)(J)(iii) and Education Code Section 48852.7</citation>\n                    <text>Transportation shall be provided to and from the school of origin, as requested by the parent or guardian (or unaccompanied youth), or to the school where the child or youth is enrolled.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district shall provide transportation for homeless students to and from their school of origin when requested by the parent/guardian or unaccompanied youth, or to the school where the student is enrolled. Transportation shall be provided for the entire time the student remains homeless and until the end of any academic year in which the student becomes permanently housed.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Transportation Safety Requirements</title>\n            <description>The regulation lacks specific safety requirements for route design and hazard assessment that are mandated by California law, including requirements for traffic safety considerations and hazardous route determinations.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 39800.5</citation>\n                    <text>The governing board of any school district may provide for the transportation of pupils to and from school whenever the board determines that the transportation is advisable and good cause exists therefor.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Route design shall consider traffic volume, vehicle speed, road conditions, weather conditions, visibility, and other safety factors. The district shall assess and document hazardous conditions that may require transportation services even within normal walking distances.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"75\">\n            <title>Missing Foster Youth Transportation Provisions</title>\n            <description>The regulation does not specifically address transportation requirements for foster youth, which have specific legal protections similar to homeless students under recent legislative changes.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 48853.5</citation>\n                    <text>Foster youth have rights to remain in their school of origin and receive appropriate transportation.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Transportation shall be provided for foster youth to and from their school of origin when it is in their best interest, as determined in collaboration with child welfare agencies.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"70\">\n            <title>Outdated Document Date</title>\n            <description>The regulation was last updated in 2009 and may not reflect current legal requirements, particularly regarding homeless students, foster youth, and updated safety standards that have been enacted since then.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 35160.5</citation>\n                    <text>School districts must ensure policies remain current with applicable law.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Regular review and update of transportation policies and regulations to ensure compliance with current state and federal requirements.</text>\n            </required_language>\n\n            <recommended_placement>BOTH</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T13:30:32.872198+00:00"
}