{
  "code": "4032",
  "has_policy": false,
  "has_regulation": true,
  "policy": null,
  "regulation": {
    "code": "4032",
    "title": "Reasonable Accommodation",
    "type": "Regulation",
    "last_reviewed": "11/04/2009",
    "file_path": "data/extracted/regulations/4032.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 209",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"95\">\n            <title>Missing Board Policy Foundation</title>\n            <description>The district lacks a Board Policy (BP 4032) to establish the board's commitment to reasonable accommodation and provide policy-level direction. While the Administrative Regulation provides detailed procedures, there is no foundational policy statement from the board establishing the district's obligation to provide reasonable accommodations as required by law.</description>\n            <missing_from>BP</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code Section 12940(m)</citation>\n                    <text>It shall be an unlawful employment practice... [f]or an employer... to fail to make reasonable accommodation for the known physical or mental disability of an applicant or employee.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The Board is committed to providing equal employment opportunities and reasonable accommodations for qualified individuals with disabilities in accordance with the Americans with Disabilities Act, California Fair Employment and Housing Act, and other applicable laws. The district shall provide reasonable accommodations to qualified employees and applicants with disabilities unless such accommodation would impose an undue hardship on district operations.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Interactive Process Timeline Requirements</title>\n            <description>While the regulation mentions an \"informal, interactive process,\" it fails to specify required timelines for initiating and completing the interactive process as mandated by California law. The regulation should establish specific timeframes for responding to accommodation requests.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code Section 12940(n)</citation>\n                    <text>It shall be an unlawful employment practice... [t]o fail to engage in a timely, good faith, interactive process with the employee or applicant to determine effective reasonable accommodations, if any, in response to a request for reasonable accommodation by an employee or applicant with a known physical or mental disability or known medical condition.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The interactive process shall commence within 10 working days of receiving a request for reasonable accommodation. The district shall engage in a timely, good faith interactive process and shall provide a response regarding the accommodation request within 30 working days, unless additional time is needed to obtain medical documentation or assess complex accommodation requests.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing California Fair Employment and Housing Act References</title>\n            <description>The regulation references only federal ADA requirements but fails to acknowledge California's Fair Employment and Housing Act (FEHA), which provides broader protections and different requirements than federal law. California school districts must comply with both federal and state requirements.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code Section 12900 et seq.</citation>\n                    <text>The Fair Employment and Housing Act provides protections against employment discrimination and requires reasonable accommodations that may exceed federal ADA requirements.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district shall comply with all applicable federal and state laws regarding reasonable accommodations, including but not limited to the Americans with Disabilities Act (ADA), Section 504 of the Rehabilitation Act, and the California Fair Employment and Housing Act (FEHA). Where state and federal requirements differ, the district shall apply the standard that provides greater protection to individuals with disabilities.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"80\">\n            <title>Missing Confidentiality Provisions</title>\n            <description>The regulation does not address confidentiality requirements for medical information obtained during the accommodation process, which is required under both federal and California law.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code Section 12940(d)</citation>\n                    <text>Medical information obtained regarding the medical condition or history of an applicant is subject to confidentiality requirements and restrictions on use.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>All medical information obtained in connection with a request for reasonable accommodation shall be kept confidential and stored separately from personnel files. Such information may only be shared with individuals who have a legitimate need to know for purposes of providing the accommodation or meeting safety requirements.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"75\">\n            <title>Missing Training Requirements</title>\n            <description>The policy/regulation set does not address training requirements for supervisors and HR personnel on reasonable accommodation obligations, which is a best practice for compliance.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code Section 12950.1</citation>\n                    <text>Employers should provide training to supervisory employees regarding their obligations under fair employment laws, including reasonable accommodation requirements.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district shall provide training to supervisors, administrators, and human resources personnel regarding reasonable accommodation obligations, the interactive process, and confidentiality requirements. Such training shall be provided regularly and updated as laws change.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T13:32:45.827259+00:00"
}