{
  "code": "4112.1",
  "has_policy": false,
  "has_regulation": true,
  "policy": null,
  "regulation": {
    "code": "4112.1",
    "title": "Contracts",
    "type": "Regulation",
    "last_reviewed": "11/04/2009",
    "file_path": "data/extracted/regulations/4112.1.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 320",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"95\">\n            <title>Missing Board Policy Document</title>\n            <description>The Board Policy (BP) 4112.1 document is entirely missing. California school districts are required to have board policies that establish the legal framework and board direction for personnel contracts. The Administrative Regulation alone cannot fulfill all legal requirements without corresponding board policy direction.</description>\n            <missing_from>BP</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 35160</citation>\n                    <text>The governing board of a school district may initiate and carry on any program, activity, or may otherwise act in any manner which is not in conflict with or inconsistent with, or preempted by, any law and which is not in conflict with the purposes for which school districts are established.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>A comprehensive Board Policy should be established that addresses the board's authority and direction regarding personnel contracts, including but not limited to: board authority to approve contracts, types of contracts authorized, and general principles governing employment agreements.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Incomplete Contract Requirements Coverage</title>\n            <description>The current regulation only addresses initial employment statements for certificated employees but fails to address comprehensive contract requirements including probationary contracts, permanent contracts, temporary contracts beyond initial employment, and classified employee contracts. California Education Code requires specific procedures for different types of employment contracts.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Sections 44929.21, 44915, 45103</citation>\n                    <text>Various sections require specific contract procedures for probationary employees (44929.21), certificated employee contracts (44915), and classified employee employment (45103).</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Procedures must be established for: (1) Probationary certificated employee contracts with required notifications and evaluation procedures; (2) Permanent certificated employee contract renewals; (3) Temporary certificated employee contracts with specific duration limits; (4) Classified employee employment agreements and probationary periods.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Contract Approval Authority</title>\n            <description>Neither document establishes the board's authority and procedures for approving employment contracts. California law requires governing boards to approve personnel actions, and this authority should be clearly established in policy with implementing procedures in regulation.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                <citation>Education Code Section 35161</citation>\n                <text>The governing board shall employ and discharge personnel and prescribe their duties in accordance with law.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Policy should establish board authority to approve all employment contracts and personnel actions. Regulation should specify procedures for presenting contracts to the board, required documentation, and approval processes.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"88\">\n            <title>Missing Probationary Employee Notification Requirements</title>\n            <description>The regulation lacks required procedures for probationary employee notifications, including dismissal notifications and evaluation requirements that are mandated by California Education Code for both certificated and classified employees.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Sections 44929.21, 45113</citation>\n                    <text>Section 44929.21 requires specific notification procedures for probationary certificated employees. Section 45113 establishes probationary periods for classified employees.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Procedures must specify: (1) Probationary periods for certificated (two years) and classified employees; (2) Required notification timelines for non-reelection or dismissal; (3) Evaluation requirements during probationary periods; (4) Documentation requirements for personnel files.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"75\">\n            <title>Outdated Last Review Date</title>\n            <description>The policy/regulation set has not been reviewed since 2009, which is over 14 years ago. While not legally required, regular review ensures continued compliance with evolving legal requirements and best practices.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Best Practice Recommendation</citation>\n                    <text>Regular policy review ensures continued legal compliance and effectiveness.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Establish regular review cycle for personnel contract policies and regulations, recommended every 3-5 years or when significant legal changes occur.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T13:33:12.682428+00:00"
}