{
  "code": "4112.23",
  "has_policy": false,
  "has_regulation": true,
  "policy": null,
  "regulation": {
    "code": "4112.23",
    "title": "Special Education Staff",
    "type": "Regulation",
    "last_reviewed": "11/04/2009",
    "file_path": "data/extracted/regulations/4112.23.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 320",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"95\">\n            <title>Missing Board Policy Document</title>\n            <description>The Board Policy (BP) 4112.23 document is entirely missing. California Education Code requires school districts to adopt board policies governing special education staffing requirements, qualifications, and oversight. While the Administrative Regulation provides implementation procedures, the foundational policy direction from the Board of Education is absent.</description>\n            <missing_from>BP</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 35160</citation>\n                    <text>The governing board of a school district may initiate and carry on any program, activity, or may otherwise act in any manner which is not in conflict with or inconsistent with, or preempted by, any law and which is not in conflict with the purposes for which school districts are established.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The Board of Education recognizes the critical importance of employing qualified special education staff to serve students with disabilities. The Board shall ensure that all special education personnel possess appropriate credentials and qualifications as required by state and federal law. The Superintendent or designee shall implement procedures to ensure compliance with special education staffing requirements, including credential verification, caseload management, and ongoing professional development.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Paraprofessional/Aide Qualification Requirements</title>\n            <description>Neither the BP nor AR addresses the qualification requirements for special education paraprofessionals and instructional aides who work with students with disabilities. Federal law requires specific qualifications for paraprofessionals working in programs supported by Title I funds.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>20 USC 6319(c)</citation>\n                    <text>Each paraprofessional who is employed by a school receiving Title I funds and who works in a program supported with Title I funds shall have earned a secondary school diploma or its recognized equivalent and have completed at least 2 years of study at an institution of higher education, obtained an associate's degree, or met a rigorous standard of quality.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Special education paraprofessionals and instructional aides shall meet the qualification requirements established by federal and state law, including completion of a secondary school diploma or equivalent and additional education or training requirements as specified in applicable regulations.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Professional Development Requirements</title>\n            <description>Neither document addresses the ongoing professional development and training requirements for special education staff to maintain current knowledge of best practices, legal requirements, and specialized instructional techniques.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 56240</citation>\n                    <text>Personnel development activities shall be designed to ensure that personnel are able to meet the needs of individuals with exceptional needs and shall include training in the use of positive behavioral interventions and supports.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district shall provide ongoing professional development for special education staff to ensure current knowledge of evidence-based practices, legal requirements, and specialized instructional techniques. Training shall include positive behavioral interventions and supports, and other areas identified through needs assessment.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"80\">\n            <title>Missing Substitute Teacher Qualification Requirements</title>\n            <description>Neither document addresses the credential and qualification requirements for substitute teachers serving in special education positions, which must meet the same standards as regular special education staff.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>5 CCR 80046.5</citation>\n                    <text>Teachers assigned to serve individuals with exceptional needs shall possess the credential that authorizes them to teach the primary disability of the individuals within the program placement.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Substitute teachers assigned to special education positions shall possess appropriate credentials authorizing them to serve students with disabilities in the specific program placement, or shall work under the direct supervision of a properly credentialed special education teacher.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T13:33:35.800620+00:00"
}