{
  "code": "4112.4",
  "has_policy": false,
  "has_regulation": true,
  "policy": null,
  "regulation": {
    "code": "4112.4",
    "title": "Health Examinations",
    "type": "Regulation",
    "last_reviewed": "11/04/2009",
    "file_path": "data/extracted/regulations/4112.4.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 320",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"95\">\n            <title>Missing Board Policy Document</title>\n            <description>The Board Policy (BP) 4112.4 document is entirely missing. While the Administrative Regulation provides implementation procedures, California school districts are required to have both policy and regulation documents. The Board Policy should establish the board's direction and authority for health examinations, while the AR provides the implementation details.</description>\n            <missing_from>BP</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code 35160</citation>\n                    <text>The governing board of a school district may initiate and carry on any program, activity, or may otherwise act in any manner which is not in conflict with or inconsistent with, or preempted by, any law and which is not in conflict with the purposes for which school districts are established.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>A Board Policy should be created that establishes the board's commitment to health examinations for employees, references legal requirements, and provides policy direction for implementation through the administrative regulation.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Mental Examination Procedures</title>\n            <description>The regulation mentions that mental examination procedures shall follow Education Code 44942 and collective bargaining agreements but does not specify the required procedural steps. Education Code 44942 requires specific due process procedures that should be outlined.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code 44942</citation>\n                    <text>Requires specific procedures including written notice, opportunity for hearing, examination by qualified professionals, and due process protections for certificated employees subject to mental examination requirements.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The regulation should include detailed procedures for mental examinations including: written notice requirements, hearing procedures, qualifications of examining professionals, employee rights during the process, and appeal procedures as specified in Education Code 44942.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Health Examination Requirements for Classified Employees</title>\n            <description>The regulation addresses tuberculosis testing for both classified and certificated employees, and medical certification for certificated employees, but does not address general health examination requirements for classified employees beyond TB testing.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code 45122</citation>\n                    <text>Classified employees may be required to undergo health examinations as a condition of employment and continued employment, similar to certificated staff requirements.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Include provisions for health examinations of classified employees beyond tuberculosis testing, including medical certification requirements for positions involving contact with students and procedures for periodic examinations.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"75\">\n            <title>Outdated Tuberculosis Test Cost Limit</title>\n            <description>The regulation specifies a maximum district cost of $120.00 for tuberculosis tests, but this amount has not been updated since 2009 and may not reflect current medical costs.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code 49406</citation>\n                    <text>Requires districts to provide tuberculosis examinations at district expense but allows districts to set reasonable cost limits.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Update the maximum reimbursement amount for tuberculosis examinations to reflect current medical costs, or establish a mechanism for periodic review and adjustment of the cost limit.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T13:33:53.323788+00:00"
}