{
  "code": "4119.11",
  "has_policy": true,
  "has_regulation": true,
  "policy": {
    "code": "4119.11",
    "title": "Sex Discrimination and Sex-Based Harassment",
    "type": "Policy",
    "last_reviewed": "04/27/2022",
    "file_path": "data/extracted/policies/4119.11.txt"
  },
  "regulation": {
    "code": "4119.11",
    "title": "Sex Discrimination and Sex-Based Harassment",
    "type": "Regulation",
    "last_reviewed": "04/27/2022",
    "file_path": "data/extracted/regulations/4119.11.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 30, column 486",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"95\">\n            <title>Missing Board Policy Content</title>\n            <description>The Board Policy (BP 4119.11) contains no content whatsoever. California Education Code requires that the governing board adopt a policy prohibiting sexual harassment. The policy should contain the board's commitment, rights statements, and high-level directives, while leaving implementation details to the administrative regulation.</description>\n            <missing_from>BP</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 231.5</citation>\n                    <text>The governing board of each school district shall adopt a policy that prohibits discrimination, harassment, intimidation, and bullying based on the actual or perceived characteristics set forth in Section 422.55 of the Penal Code and Education Code Section 220, and disability, gender, gender identity, gender expression, nationality, race or ethnicity, religion, sexual orientation, or association with a person or group with one or more of these actual or perceived characteristics.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The Board Policy must include: (1) Board's commitment to maintaining a workplace free from sexual harassment and sex discrimination; (2) Statement that sexual harassment and sex discrimination are prohibited and will not be tolerated; (3) Statement of employee rights; (4) Reference to complaint procedures; (5) Anti-retaliation statement; (6) Delegation of authority to Superintendent for implementation.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Pregnancy-Related Discrimination Coverage</title>\n            <description>Neither the BP nor AR addresses pregnancy-related discrimination, which is required to be covered under sex discrimination policies. This includes discrimination based on pregnancy, childbirth, or related medical conditions.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code Section 12945</citation>\n                    <text>It shall be an unlawful employment practice for an employer to refuse to hire or employ a person or to refuse to select a person for a training program leading to employment, or to bar or to discharge a person from employment or from a training program leading to employment, or to discriminate against a person in compensation or in terms, conditions, or privileges of employment because of the person's pregnancy, childbirth, or related medical conditions.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district prohibits discrimination based on pregnancy, childbirth, or related medical conditions. Employees affected by pregnancy or related conditions shall be treated the same as other employees who are similar in their ability or inability to work.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Gender Identity and Expression in Core Definitions</title>\n            <description>While the AR mentions gender identity and expression in training requirements, the core sex discrimination definition and prohibitions do not explicitly include gender identity, gender expression, and sexual orientation as protected characteristics under sex discrimination.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 220</citation>\n                    <text>No person shall be subjected to discrimination on the basis of disability, gender, gender identity, gender expression, nationality, race or ethnicity, religion, sexual orientation, or any other characteristic that is contained in the definition of hate crimes set forth in Section 422.55 of the Penal Code, including immigration status, in any program or activity conducted by an educational institution that receives, or benefits from, state financial assistance, or enrolls pupils who receive state student financial aid.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Sex discrimination includes discrimination based on sex, gender, gender identity, gender expression, sexual orientation, pregnancy, childbirth, or related medical conditions.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"75\">\n            <title>Missing Reference to Fair Employment and Housing Act</title>\n            <description>The AR references Government Code 12950 requirements but does not explicitly reference the Fair Employment and Housing Act (FEHA) as the underlying legal framework, which provides important context for employees understanding their rights.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code Section 12900 et seq. (FEHA)</citation>\n                    <text>The Fair Employment and Housing Act provides the comprehensive framework for addressing employment discrimination, including sexual harassment, in California.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>This policy is implemented in accordance with the California Fair Employment and Housing Act and other applicable state and federal laws.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T14:10:14.843216+00:00"
}