{
  "code": "4213.4",
  "has_policy": true,
  "has_regulation": false,
  "policy": {
    "code": "4213.4",
    "title": "Temporary Modified/Light-Duty Assignment",
    "type": "Policy",
    "last_reviewed": "12/11/2024",
    "file_path": "data/extracted/policies/4213.4.txt"
  },
  "regulation": null,
  "compliance": {
    "issues": [
      {
        "priority": "MATERIAL",
        "confidence": 85,
        "title": "Missing Administrative Regulation for Implementation Procedures",
        "description": "The Board Policy establishes the framework for temporary modified/light-duty assignments but lacks the detailed administrative procedures required for implementation. California Education Code requires districts to have clear procedures for personnel matters, and temporary duty assignments involve complex administrative processes including application procedures, medical documentation requirements, position identification, and coordination with workers' compensation.",
        "missing_from": "AR",
        "legal_citations": [
          {
            "citation": "Education Code Section 44040",
            "text": "The governing board of any school district may adopt rules and regulations for the government of the schools under its jurisdiction."
          }
        ],
        "required_language": "Administrative Regulation 4213.4 should include: (1) Application procedures and required forms; (2) Medical documentation requirements and physician certification process; (3) Process for identifying and evaluating available temporary positions; (4) Criteria for determining suitable accommodations; (5) Procedures for monitoring and reviewing temporary assignments; (6) Extension request procedures and timelines; (7) Coordination with workers' compensation and benefits administration; (8) Return-to-work procedures and medical clearance requirements.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MATERIAL",
        "confidence": 90,
        "title": "Missing Interactive Process Requirements Under ADA",
        "description": "The policy lacks reference to the required interactive process under the Americans with Disabilities Act and California Fair Employment and Housing Act. When an employee requests modified duty due to a medical condition, the district must engage in an interactive process to determine reasonable accommodations, even for temporary assignments.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Government Code Section 12940(n)",
            "text": "It shall be an unlawful employment practice for an employer to fail to engage in a timely, good faith, interactive process with the employee to determine effective reasonable accommodations."
          }
        ],
        "required_language": "The district shall engage in an interactive process with employees requesting temporary modified/light-duty assignments to identify and evaluate potential reasonable accommodations, including but not limited to temporary job restructuring, modified schedules, or alternative assignments that do not impose an undue hardship on district operations.",
        "recommended_placement": "BP"
      },
      {
        "priority": "MATERIAL",
        "confidence": 80,
        "title": "Missing Non-Discrimination and Equal Opportunity Statement",
        "description": "The policy does not include required language ensuring that temporary modified/light-duty assignments are provided without regard to protected characteristics and in compliance with anti-discrimination laws. This is particularly important given the intersection with disability accommodation requirements.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Government Code Section 12900 et seq. (FEHA)",
            "text": "It shall be an unlawful employment practice for an employer to discriminate against any person in compensation or in terms, conditions, or privileges of employment because of protected characteristics including disability."
          }
        ],
        "required_language": "Temporary modified/light-duty assignments shall be provided in a manner consistent with applicable federal and state anti-discrimination laws and without regard to race, color, national origin, religion, sex, gender identity, sexual orientation, pregnancy, disability, age, or other protected characteristics.",
        "recommended_placement": "BP"
      },
      {
        "priority": "MINOR",
        "confidence": 75,
        "title": "Missing Reference to Collective Bargaining Agreements",
        "description": "The policy does not acknowledge that temporary modified/light-duty assignments may be subject to applicable collective bargaining agreement provisions, which could create conflicts between policy implementation and contractual obligations.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Government Code Section 3543.2",
            "text": "The scope of representation shall include matters relating to wages, hours of employment, and other terms and conditions of employment."
          }
        ],
        "required_language": "Implementation of temporary modified/light-duty assignments shall be consistent with applicable collective bargaining agreements and meet-and-confer requirements.",
        "recommended_placement": "BP"
      }
    ]
  },
  "check_date": "2025-06-01T14:14:17.476539+00:00"
}