{
  "code": "4241.6",
  "has_policy": true,
  "has_regulation": false,
  "policy": {
    "code": "4241.6",
    "title": "Concerted Action/Work Stoppage",
    "type": "Policy",
    "last_reviewed": "06/15/2022",
    "file_path": "data/extracted/policies/4241.6.txt"
  },
  "regulation": null,
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 266",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Administrative Regulation for Implementation Procedures</title>\n            <description>While the Board Policy establishes the framework for handling work stoppages, there is no Administrative Regulation providing detailed implementation procedures. The policy references that the Superintendent \"shall develop a written plan\" but lacks the procedural details typically found in regulations, such as specific notification timelines, detailed communication protocols, and step-by-step procedures for maintaining operations during a work stoppage.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 3543.1</citation>\n                    <text>Requires public school employers to meet and negotiate in good faith regarding wages, hours of employment, and other terms and conditions of employment with exclusive representatives, and establishes framework for handling labor disputes.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Administrative Regulation should include: (1) Specific timelines for notifications to PERB and other parties; (2) Detailed communication protocols and templates; (3) Step-by-step procedures for maintaining student safety and supervision; (4) Protocols for coordinating with law enforcement; (5) Procedures for documenting employee participation in unlawful activities; (6) Guidelines for post-strike relationship rebuilding; (7) Emergency contact procedures and decision-making authority during work stoppages.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"70\">\n            <title>Lack of Specific Legal Citation References</title>\n            <description>The policy does not reference specific legal authorities that govern work stoppages and strikes by public employees, which would help ensure compliance and provide clarity to staff implementing the policy. While not legally required, best practice includes citing relevant Education Code and Government Code sections.</description>\n            <missing_from>BP</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 3543.6(b)</citation>\n                    <text>It shall be unlawful for public school employees to strike, and any employee organization which authorizes, instigates, aids, or abets a strike shall be liable for damages caused by such strike.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Policy should reference key legal authorities including Education Code Section 3543.6(b) regarding unlawful strikes by public school employees, and Government Code Section 3502 regarding public employee rights and restrictions.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"75\">\n            <title>Missing Reference to Substitute Teacher Procurement</title>\n            <description>The policy mentions maintaining \"appropriate student instruction and supervision\" but does not specifically address procedures for securing substitute teachers or alternative instructional staff during a work stoppage, which is a critical operational need.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 44918</citation>\n                    <text>Establishes requirements for substitute teachers and emergency permits, which become critical during work stoppages to maintain instructional services.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Policy or regulation should include provisions for securing substitute teachers, emergency permits, and alternative staffing arrangements to maintain instructional continuity during work stoppages, in compliance with credentialing requirements.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T14:15:43.369708+00:00"
}