{
  "code": "4261.5",
  "has_policy": false,
  "has_regulation": true,
  "policy": null,
  "regulation": {
    "code": "4261.5",
    "title": "Military Leave",
    "type": "Regulation",
    "last_reviewed": "12/07/2022",
    "file_path": "data/extracted/regulations/4261.5.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 320",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"95\">\n            <title>Missing Board Policy Document</title>\n            <description>The district has only an Administrative Regulation (AR 4261.5) but no corresponding Board Policy (BP 4261.5) for military leave. California school districts are required to have board policies that establish the district's commitment to compliance with military leave laws and provide board-level direction on this employment matter.</description>\n            <missing_from>BP</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 35160</citation>\n                    <text>The governing board of a school district may initiate and carry on any program, activity, or may otherwise act in any manner which is not in conflict with or inconsistent with, or preempted by, any law and which is not in conflict with the purposes for which school districts are established.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The Board recognizes its obligation to provide military leave to employees in accordance with state and federal law. The district shall grant military leave to employees performing military duties on a voluntary or involuntary basis in uniformed services. The Superintendent or designee shall establish procedures to implement this policy in compliance with applicable laws including the Uniformed Services Employment and Reemployment Rights Act (USERRA) and California Military and Veterans Code provisions.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"85\">\n            <title>Missing Reference to Funeral Honors Duty Compensation</title>\n            <description>While the AR mentions funeral honors duty as qualifying military service, it does not specifically address compensation entitlements for funeral honors duty, which has specific provisions under California law.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Military and Veterans Code Section 395.9</citation>\n                    <text>Any employee of a public agency who is a member of the National Guard, organized militia, or reserve component of the armed forces and who has been employed by the public agency for at least one year immediately prior to the day the military leave begins, shall be entitled to receive salary or compensation for funeral honors duty not to exceed 30 days in any one fiscal year.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>An employee who is a member of the National Guard, organized militia, or reserve component of the armed forces and who has been employed by the district for at least one year shall be entitled to receive salary or compensation for funeral honors duty not to exceed 30 days in any one fiscal year.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"80\">\n            <title>Incomplete USERRA Notice Posting Requirements</title>\n            <description>While the AR mentions providing USERRA notices, it doesn't specify that the notice must be provided to employees upon hiring and doesn't reference the specific Department of Labor notice format requirements.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>38 USC 4334</citation>\n                    <text>Each employer shall provide to persons entitled to rights and benefits under this chapter a notice of the rights, benefits, and obligations of such persons and such employers under this chapter.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district shall provide the USERRA notice to employees upon hiring and shall use the notice format prescribed by the U.S. Department of Labor. The notice shall be posted in locations where employee notices are customarily posted and provided to employees in employee handbooks or similar materials.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T14:15:59.388963+00:00"
}