{
  "code": "5111.12",
  "has_policy": false,
  "has_regulation": true,
  "policy": null,
  "regulation": {
    "code": "5111.12",
    "title": "Residency Based On Parent/Guardian Employment",
    "type": "Regulation",
    "last_reviewed": "01/13/2010",
    "file_path": "data/extracted/regulations/5111.12.txt"
  },
  "compliance": {
    "issues": [
      {
        "priority": "MATERIAL",
        "confidence": 95,
        "title": "Missing Board Policy Document",
        "description": "The district has only an Administrative Regulation (AR) but no corresponding Board Policy (BP) for residency based on parent/guardian employment. California school districts are required to have board policies that establish the legal framework and board direction for significant operational areas like student enrollment and residency determinations. The AR contains implementation procedures but lacks the foundational policy statements that should come from the governing board.",
        "missing_from": "BP",
        "legal_citations": [
          {
            "citation": "Education Code Section 35160",
            "text": "The governing board of a school district may initiate and carry on any program, activity, or may otherwise act in any manner which is not in conflict with or inconsistent with, or preempted by, any law and which is not in conflict with the purposes for which school districts are established."
          }
        ],
        "required_language": "The Board of Education recognizes that students may be eligible for enrollment in district schools based on parent/guardian employment within district boundaries as provided by law. The Board shall establish procedures for evaluating and processing such enrollment requests, including criteria for approval or denial of applications. The Board reserves the right to deny enrollment when circumstances warrant such denial as permitted by law.",
        "recommended_placement": "BP"
      },
      {
        "priority": "MATERIAL",
        "confidence": 90,
        "title": "Missing Appeal Process",
        "description": "Neither the BP (which doesn't exist) nor the AR provides students/parents with information about their right to appeal denial decisions or the process for doing so. California law requires that students have due process rights in enrollment decisions, and districts must provide clear procedures for challenging adverse determinations.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Education Code Section 48204(b)",
            "text": "The governing board of a school district may prohibit the transfer of a pupil under this section if it makes a written finding that the transfer would negatively impact the court-ordered or voluntary desegregation plan of the school district."
          }
        ],
        "required_language": "Parents/guardians may appeal the Board's decision to deny enrollment based on parent/guardian employment by filing a written appeal with the Superintendent within [X] days of receiving the denial notice. The appeal shall be heard by the Board or designated hearing officer within [X] days of receipt. The parent/guardian shall have the right to present evidence and testimony in support of the appeal.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MATERIAL",
        "confidence": 85,
        "title": "Missing Percentage Limits and Calculation Method",
        "description": "The AR references \"limits prescribed in Education Code 48204\" for the percentage of students that may transfer out based on parent/guardian employment but does not specify what those limits are or how they are calculated. This creates ambiguity in implementation and potential inconsistent application.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Education Code Section 48204(a)",
            "text": "A pupil complies with the residency requirements for school attendance in a school district if the pupil is any of the following: [...] (7) A pupil whose parent or legal guardian is physically employed within the boundaries of that school district for a minimum of 10 hours during the school week."
          }
        ],
        "required_language": "The district shall track and maintain records of the percentage of students admitted to other districts based on parent/guardian employment. This percentage shall not exceed the percentage of students from other districts admitted to this district on the same basis, as calculated annually based on enrollment data from the prior school year.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MINOR",
        "confidence": 80,
        "title": "Missing Minimum Hours Requirement",
        "description": "The AR does not specify the minimum number of hours per week that constitutes \"physical employment\" within district boundaries. Education Code 48204 specifies a minimum of 10 hours per school week.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Education Code Section 48204(a)(7)",
            "text": "A pupil whose parent or legal guardian is physically employed within the boundaries of that school district for a minimum of 10 hours during the school week."
          }
        ],
        "required_language": "Physical employment must be for a minimum of 10 hours during the school week to qualify for residency status under this provision.",
        "recommended_placement": "AR"
      }
    ]
  },
  "check_date": "2025-06-01T14:19:06.959669+00:00"
}