{
  "code": "5131.1",
  "has_policy": true,
  "has_regulation": true,
  "policy": {
    "code": "5131.1",
    "title": "Bus Conduct",
    "type": "Policy",
    "last_reviewed": "01/13/2010",
    "file_path": "data/extracted/policies/5131.1.txt"
  },
  "regulation": {
    "code": "5131.1",
    "title": "Bus Conduct",
    "type": "Regulation",
    "last_reviewed": "01/13/2010",
    "file_path": "data/extracted/regulations/5131.1.txt"
  },
  "compliance": {
    "issues": [
      {
        "priority": "MATERIAL",
        "confidence": 85,
        "title": "Missing Due Process Requirements for Transportation Suspension",
        "description": "California law requires specific due process procedures before denying transportation services to students, including written notice, opportunity for hearing, and appeal rights. While the AR mentions \"notice and warning,\" it lacks the comprehensive due process protections mandated by law.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Education Code Section 48915.5",
            "text": "Before a pupil may be denied transportation services, the pupil and the pupil's parent or guardian shall be given written notice of the intention to deny transportation services and the reasons therefor, and shall be given an opportunity for a hearing before the governing board or a person designated by the governing board."
          }
        ],
        "required_language": "Before denying transportation services, the district shall provide written notice to the student and parent/guardian stating the intention to deny services and the specific reasons. The notice shall include the right to request a hearing before the governing board or designee within a specified timeframe. The student shall have the right to present evidence and testimony at the hearing, and the right to appeal the decision.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MATERIAL",
        "confidence": 90,
        "title": "Missing Emergency Evacuation Procedures",
        "description": "California regulations require school districts to establish and communicate emergency evacuation procedures for school buses. Neither the policy nor regulation addresses emergency evacuation requirements, safety drills, or emergency exit procedures.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "5 CCR Section 14103",
            "text": "The governing board of each school district providing pupil transportation services shall adopt rules and regulations for pupil conduct while riding on school buses, including emergency evacuation procedures."
          }
        ],
        "required_language": "Students shall be instructed in emergency evacuation procedures including location and use of emergency exits, evacuation signals, and proper evacuation techniques. Emergency evacuation drills shall be conducted as required by law. Students must follow all emergency procedures and directions from the bus driver during emergency situations.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MATERIAL",
        "confidence": 80,
        "title": "Incomplete Video Surveillance Privacy Protections",
        "description": "While the AR addresses video surveillance procedures, it lacks specific privacy protections required under California privacy laws, including data retention limits, access restrictions, and privacy impact considerations for minors.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Education Code Section 49073.6",
            "text": "Student privacy rights must be protected in the collection, maintenance, and disclosure of student information, including video recordings that may contain personally identifiable information about students."
          }
        ],
        "required_language": "Video recordings shall be maintained securely with access limited to authorized personnel only. Recordings containing no misconduct shall be erased within a specified timeframe not to exceed 30 days. Any disclosure of video recordings must comply with student privacy laws and may require parental consent for minor students.",
        "recommended_placement": "AR"
      },
      {
        "priority": "MINOR",
        "confidence": 75,
        "title": "Missing Reference to Special Needs Transportation",
        "description": "The policy and regulation do not address conduct expectations or procedures specific to students receiving special education transportation services, who may require modified behavioral expectations or interventions.",
        "missing_from": "BOTH",
        "legal_citations": [
          {
            "citation": "Education Code Section 56040",
            "text": "Transportation services for individuals with exceptional needs shall be provided in accordance with their individualized education programs and may require specialized conduct considerations."
          }
        ],
        "required_language": "For students receiving special education services, bus conduct expectations and disciplinary procedures shall be consistent with the student's Individualized Education Program (IEP) or Section 504 plan. Any suspension of transportation services for special needs students shall comply with special education due process requirements.",
        "recommended_placement": "AR"
      }
    ]
  },
  "check_date": "2025-06-01T14:21:45.229450+00:00"
}