{
  "code": "5136",
  "has_policy": true,
  "has_regulation": true,
  "policy": {
    "code": "5136",
    "title": "Gangs",
    "type": "Policy",
    "last_reviewed": "01/13/2010",
    "file_path": "data/extracted/policies/5136.txt"
  },
  "regulation": {
    "code": "5136",
    "title": "Gangs",
    "type": "Regulation",
    "last_reviewed": "01/13/2010",
    "file_path": "data/extracted/regulations/5136.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 294",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Mandatory Suspension/Expulsion for Gang-Related Violence</title>\n            <description>California Education Code requires mandatory consideration of suspension or expulsion for students who commit acts of hate violence, make terrorist threats, or engage in harassment/intimidation/bullying that is gang-related. The policy and regulation focus on prevention but do not address required disciplinary consequences for gang-related violations.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 48900.3</citation>\n                    <text>A pupil shall not harass, threaten, or intimidate a pupil who is a complaining witness or witness in a school disciplinary proceeding for the purpose of either preventing that pupil from being a witness or retaliating against that pupil for being a witness, or both.</citation>\n                </california_code>\n                <california_code>\n                    <citation>Education Code Section 48900.4</citation>\n                    <text>A pupil shall not intentionally engage in harassment, threats, or intimidation, directed against school district personnel or pupils, that is sufficiently severe or pervasive to have the actual and reasonably expected effect of materially disrupting classwork, creating substantial disorder, and invading the rights of either school personnel or pupils by creating an intimidating or hostile educational environment.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Students who engage in gang-related activities that constitute harassment, intimidation, threats, or violence may be subject to suspension or expulsion in accordance with Education Code sections 48900 et seq. Gang-related behavior that creates a hostile educational environment or materially disrupts the educational process shall result in appropriate disciplinary action up to and including expulsion.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Safe School Plan Integration Requirement</title>\n            <description>California law requires that gang violence prevention strategies be integrated into the school's comprehensive safety plan. Neither the policy nor regulation references coordination with or inclusion in the required school safety plan.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 32282</citation>\n                    <text>The comprehensive school safety plan shall include procedures for conducting tactical responses to criminal incidents, including procedures related to individuals with guns on school campuses and at school-related functions, and gang violence.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Gang prevention and intervention strategies shall be integrated into the district's comprehensive school safety plan as required by Education Code Section 32282. The safety plan shall include specific procedures for responding to gang-related incidents and violence on campus.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"80\">\n            <title>Missing Due Process Protections for Gang Allegations</title>\n            <description>The regulation allows for immediate referral and potential removal of students based on \"behavior, gestures, apparel or paraphernalia indicative of gang affiliation\" without specifying due process protections or appeal rights required under California law.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 48911</citation>\n                    <text>The principal or the principal's designee shall immediately suspend any pupil found at school or at a school activity to be under the influence of, or to have sold, furnished, or otherwise provided, or to have been in unlawful possession of, alcohol or of any controlled substance.</text>\n                </california_code>\n                <california_code>\n                    <citation>Education Code Section 48918</citation>\n                    <text>Prior to the suspension or expulsion of any pupil, the pupil shall be entitled to a hearing to determine whether the pupil should be suspended or expelled.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Before taking disciplinary action based on suspected gang affiliation, students shall be provided with appropriate due process including notice of the specific allegations, an opportunity to respond, and access to the appeals process. Mere association, appearance, or symbolic expression alone shall not constitute grounds for disciplinary action unless it substantially disrupts the educational environment.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"70\">\n            <title>Missing Annual Review and Data Collection</title>\n            <description>The policy lacks provisions for annual review of gang prevention effectiveness and data collection on gang-related incidents, which are recommended practices for maintaining effective prevention programs.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 32282.1</citation>\n                    <text>The comprehensive school safety plan shall be reviewed and updated by March 1 of every year by the school site council.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The Superintendent or designee shall annually review the effectiveness of gang prevention and intervention strategies and report findings to the Board. Data on gang-related incidents shall be collected and analyzed to inform program improvements.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T14:23:31.692547+00:00"
}