{
  "code": "5142.2",
  "has_policy": true,
  "has_regulation": true,
  "policy": {
    "code": "5142.2",
    "title": "Safe Routes To School Program",
    "type": "Policy",
    "last_reviewed": "05/24/2023",
    "file_path": "data/extracted/policies/5142.2.txt"
  },
  "regulation": {
    "code": "5142.2",
    "title": "Safe Routes To School Program",
    "type": "Regulation",
    "last_reviewed": "05/24/2023",
    "file_path": "data/extracted/regulations/5142.2.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 464",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Helmet Requirement Notification to Parents/Guardians</title>\n            <description>California law requires districts to notify parents/guardians about mandatory helmet requirements for students under 18 who bicycle, skateboard, or use scooters. While the AR mentions monitoring helmet compliance, neither document addresses the required parental notification component.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Vehicle Code Section 21212(b)</citation>\n                    <text>\"A person under 18 years of age shall not operate a bicycle, a nonmotorized scooter, or a skateboard, nor shall they wear in-line or roller skates, nor ride upon a bicycle, a nonmotorized scooter, or a skateboard as a passenger, upon a street, bikeway, as defined in Section 890.4 of the Streets and Highways Code, or any other public bicycle path or trail unless that person is wearing a properly fitted and fastened bicycle helmet...\"</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district shall notify parents/guardians of students who participate in safe routes to school activities about the legal requirement under Vehicle Code 21212 that students under 18 years of age must wear properly fitted and fastened bicycle helmets when bicycling, skateboarding, or using nonmotorized scooters on public streets, bikeways, or paths.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"75\">\n            <title>Missing Reference to Specific Authorized Safety Instruction Organizations</title>\n            <description>The AR references \"organizations specified in Education Code 38134\" for safety instruction but could be more explicit about what types of organizations are authorized to provide this instruction to ensure proper vetting.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 38134</citation>\n                    <text>Authorizes specific types of organizations including automobile clubs, safety councils, and other qualified organizations to provide traffic safety instruction in schools.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Safety instruction may be provided by qualified organizations as specified in Education Code 38134, including automobile clubs, safety councils, and other organizations approved by the Superintendent or designee for their expertise in traffic and pedestrian safety education.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"70\">\n            <title>Missing Accessibility Compliance Reference</title>\n            <description>While the AR mentions \"fully accessible crosswalks,\" there is no explicit reference to ADA compliance requirements for safe routes infrastructure, which is important for ensuring equitable access for students with disabilities.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Government Code Section 11135; Americans with Disabilities Act</citation>\n                    <text>Requires that public programs and services be accessible to individuals with disabilities and that physical improvements comply with accessibility standards.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>All safe routes to school infrastructure improvements and program activities shall comply with applicable accessibility requirements under the Americans with Disabilities Act and California accessibility standards to ensure equitable participation by students with disabilities.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T14:26:19.095085+00:00"
}