{
  "code": "5144.2",
  "has_policy": false,
  "has_regulation": true,
  "policy": null,
  "regulation": {
    "code": "5144.2",
    "title": "Suspension And Expulsion/Due Process (Students With Disabilities)",
    "type": "Regulation",
    "last_reviewed": "01/13/2010",
    "file_path": "data/extracted/regulations/5144.2.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 320",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"95\">\n            <title>Missing Board Policy Document</title>\n            <description>The Board Policy (BP) 5144.2 document is completely missing. California Education Code requires school districts to have board policies that establish the framework and direction for student discipline procedures, especially for students with disabilities. While the Administrative Regulation provides detailed procedures, the policy document should contain the board's philosophical stance, commitment to compliance with federal and state laws, and high-level directives.</description>\n            <missing_from>BP</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 35160</citation>\n                    <text>The governing board of a school district may initiate and carry on any program, activity, or may otherwise act in any manner which is not in conflict with or inconsistent with, or preempted by, any law and which is not in conflict with the purposes for which school districts are established.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The Board Policy should include: (1) Board's commitment to providing FAPE to students with disabilities during disciplinary proceedings; (2) Statement that students with disabilities are subject to the same disciplinary standards as non-disabled students; (3) Commitment to following federal IDEA requirements and state Education Code provisions; (4) Authority delegation to Superintendent for implementation; (5) Board's philosophy on maintaining educational services during disciplinary actions.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Expulsion Procedures for Students with Disabilities</title>\n            <description>While the regulation covers suspension procedures extensively, it lacks comprehensive expulsion procedures specific to students with disabilities. The document only briefly mentions \"suspension of expulsion\" criteria but does not detail the required procedural safeguards, manifestation determination requirements, or educational services during expulsion proceedings for students with disabilities.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 48915</citation>\n                    <text>The principal or the superintendent of schools shall immediately suspend, pursuant to Section 48911, and shall recommend expulsion of a pupil that he or she determines has committed any of the following acts at school or at a school activity off school grounds...</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Must include: (1) Manifestation determination requirements before expulsion; (2) Educational services during expulsion proceedings; (3) IEP team involvement in expulsion decisions; (4) Alternative educational settings during expulsion; (5) Procedural safeguards specific to expulsion of students with disabilities; (6) Timeline requirements for expulsion hearings.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Section 504 Student Protections</title>\n            <description>The regulation focuses exclusively on IDEA-eligible students but fails to address disciplinary protections for students with disabilities under Section 504 of the Rehabilitation Act. Section 504 students have different but equally important procedural safeguards during disciplinary proceedings.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>29 USC 794 (Section 504)</citation>\n                    <text>No otherwise qualified individual with a disability in the United States shall, solely by reason of her or his disability, be excluded from the participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving Federal financial assistance.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Must include: (1) Definition of Section 504 students; (2) Manifestation determination procedures for Section 504 students; (3) Educational services during disciplinary actions; (4) Evaluation requirements for students not yet identified under Section 504; (5) Due process rights for Section 504 students and parents.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"80\">\n            <title>Outdated Federal Regulation Citations</title>\n            <description>The regulation was last updated in 2010 and may contain outdated federal regulation citations. While the core IDEA requirements remain stable, specific CFR citations should be verified for current accuracy to ensure compliance with any regulatory updates.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>34 CFR 300 (current version)</citation>\n                    <text>Current federal regulations implementing IDEA may have been updated since 2010, requiring verification of all CFR citations for accuracy.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Review and update all 34 CFR citations to ensure they reflect current federal regulations. Verify that procedural requirements align with current IDEA implementation regulations.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T14:26:59.596944+00:00"
}