{
  "code": "6115",
  "has_policy": false,
  "has_regulation": true,
  "policy": null,
  "regulation": {
    "code": "6115",
    "title": "Ceremonies And Observances",
    "type": "Regulation",
    "last_reviewed": "06/23/2010",
    "file_path": "data/extracted/regulations/6115.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 320",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"95\">\n            <title>Missing Board Policy Document</title>\n            <description>The Board Policy (BP 6115) document is entirely missing. California Education Code requires board policies to establish the district's position on ceremonies and observances, including the educational purpose and board direction for these activities. Without a BP, there is no board-level governance or policy framework for ceremonies and observances.</description>\n            <missing_from>BP</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 35160</citation>\n                    <text>The governing board of a school district may initiate and carry on any program, activity, or may otherwise act in any manner which is not in conflict with or inconsistent with, or preempted by, any law and which is not in conflict with the purposes for which school districts are established.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>A complete Board Policy should be created that establishes the board's commitment to ceremonies and observances, their educational value, and policy direction for implementation.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Student Opt-Out Rights and Parental Notification</title>\n            <description>While the AR mentions individuals may choose not to participate in flag salute, there is no comprehensive statement about student rights to opt-out of patriotic exercises or parental notification requirements. California law protects students' rights to abstain from patriotic exercises.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 52720</citation>\n                    <text>No pupil shall be compelled, against the pupil's objections or those of the pupil's parents or guardian, to recite the Pledge of Allegiance.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Students have the right to refrain from participating in patriotic exercises, including the Pledge of Allegiance, based on their own objections or those of their parents/guardians. No student shall be compelled to participate against their will or face disciplinary action for non-participation.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Educational Purpose Statement</title>\n            <description>Neither document explains the educational purpose or objectives of ceremonies and observances. California requires that school activities serve educational purposes and align with curriculum standards.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 51220</citation>\n                    <text>The adopted course of study for grades 1 to 6, inclusive, shall include instruction, beginning in grade 1 and continuing through grade 6, in the following areas of study: social sciences, drawing upon the disciplines of anthropology, economics, geography, history, political science, psychology, and sociology, designed to fit the maturity of the pupils.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Ceremonies and observances shall serve educational purposes by promoting understanding of American history, democratic principles, civic responsibility, and cultural awareness. These activities shall align with curriculum standards and age-appropriate learning objectives.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"75\">\n            <title>Outdated Policy Date</title>\n            <description>The regulation was last updated in 2010 and may not reflect current legal requirements or best practices. Regular review ensures compliance with evolving laws and educational standards.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Education Code Section 35160.5</citation>\n                    <text>The governing board of a school district shall review and update policies as necessary to ensure compliance with current law.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Policies and regulations should be reviewed and updated regularly to ensure continued compliance with current law and best practices.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T14:29:45.656400+00:00"
}