{
  "code": "6143",
  "has_policy": true,
  "has_regulation": true,
  "policy": {
    "code": "6143",
    "title": "Courses Of Study",
    "type": "Policy",
    "last_reviewed": "06/23/2010",
    "file_path": "data/extracted/policies/6143.txt"
  },
  "regulation": {
    "code": "6143",
    "title": "Courses Of Study",
    "type": "Regulation",
    "last_reviewed": "06/23/2010",
    "file_path": "data/extracted/regulations/6143.txt"
  },
  "compliance": {
    "issues": [
      {
        "priority": "MATERIAL",
        "confidence": 95,
        "title": "Missing Required Instruction on Effects of Alcohol, Narcotics, Drugs, and Tobacco for Grades 7-8",
        "description": "Education Code 51202 requires instruction on the effects of alcohol, narcotics, drugs, and tobacco upon the human body for all grade levels. While this requirement is included for grades 1-6, it is completely missing from the grades 7-8 curriculum requirements.",
        "missing_from": "AR",
        "legal_citations": [
          {
            "citation": "Education Code Section 51202",
            "text": "The adopted course of study shall provide instruction at the appropriate grade levels and subject areas in... the effects of alcohol, narcotics, drugs, and tobacco upon the human body"
          }
        ],
        "required_language": "f. The effects of alcohol, narcotics, drugs, and tobacco upon the human body",
        "recommended_placement": "AR"
      },
      {
        "priority": "MATERIAL",
        "confidence": 90,
        "title": "Missing Career Technical Education Requirements for Grades 7-8",
        "description": "Education Code 51220 requires that courses of study for grades 7-8 include career technical education. While career awareness exploration is mentioned for grades 1-6, there is no corresponding career technical education component specified for grades 7-8.",
        "missing_from": "AR",
        "legal_citations": [
          {
            "citation": "Education Code Section 51220(b)",
            "text": "The adopted course of study for grades 7 to 12, inclusive, shall offer courses in... career technical education"
          }
        ],
        "required_language": "11. Career technical education: designed and conducted for the purpose of preparing students for gainful employment in recognized occupations and career technical education or advanced study in career technical education",
        "recommended_placement": "AR"
      },
      {
        "priority": "MATERIAL",
        "confidence": 85,
        "title": "Missing Applied Arts Requirements for Grades 7-8",
        "description": "Education Code 51220 requires instruction in applied arts for grades 7-8. This subject area is not included in the current regulation's list of required courses for grades 7-8.",
        "missing_from": "AR",
        "legal_citations": [
          {
            "citation": "Education Code Section 51220(a)",
            "text": "The adopted course of study for grades 7 to 12, inclusive, shall include... applied arts"
          }
        ],
        "required_language": "12. Applied arts: including but not limited to courses in consumer and homemaking education, industrial arts, general business education, or general agriculture",
        "recommended_placement": "AR"
      },
      {
        "priority": "MINOR",
        "confidence": 75,
        "title": "Incomplete Reference to Education Code 51202 Requirements for Grades 7-8",
        "description": "While the regulation references Education Code 51202 for personal and public safety instruction in grades 7-8, it does not include all required topics from this section, specifically missing the protection and conservation of resources requirement in the enumerated list.",
        "missing_from": "AR",
        "legal_citations": [
          {
            "citation": "Education Code Section 51202",
            "text": "The adopted course of study shall provide instruction at the appropriate grade levels and subject areas in... the protection and conservation of resources, including the necessity for the protection of our environment"
          }
        ],
        "required_language": "c. The protection and conservation of resources, including the necessity for the protection of our environment",
        "recommended_placement": "AR"
      }
    ]
  },
  "check_date": "2025-06-01T14:31:30.755151+00:00"
}