{
  "code": "6162.8",
  "has_policy": true,
  "has_regulation": true,
  "policy": {
    "code": "6162.8",
    "title": "Research",
    "type": "Policy",
    "last_reviewed": "06/23/2010",
    "file_path": "data/extracted/policies/6162.8.txt"
  },
  "regulation": {
    "code": "6162.8",
    "title": "Research",
    "type": "Regulation",
    "last_reviewed": "06/23/2010",
    "file_path": "data/extracted/regulations/6162.8.txt"
  },
  "compliance": {
    "error": "Parse error: mismatched tag: line 11, column 689",
    "raw": "<compliance_report>\n    <compliance_issues>\n        <issue priority=\"MATERIAL\" confidence=\"95\">\n            <title>Missing Protection of Pupil Rights Amendment (PPRA) Requirements</title>\n            <description>Federal PPRA requires specific procedures for surveys that ask about sensitive topics including political affiliations, mental/psychological problems, sexual behavior, illegal/antisocial behavior, critical appraisals of family members, privileged relationships, religious practices, and income. The policy mentions parental notification and consent \"in accordance with law\" but doesn't specify PPRA requirements or define covered surveys.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>20 USC 1232h (Protection of Pupil Rights Amendment)</citation>\n                    <text>No student shall be required to submit to a survey, analysis, or evaluation that reveals information concerning: (A) political affiliations or beliefs of the student or the student's parent; (B) mental or psychological problems of the student or the student's family; (C) sex behavior or attitudes; (D) illegal, anti-social, self-incriminating, or demeaning behavior; (E) critical appraisals of others with whom respondents have close family relationships; (F) legally recognized privileged relationships; (G) religious practices, affiliations, or beliefs of the student or parents; or (H) income, other than as required by law to determine program eligibility.</citation>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>The district shall comply with the Protection of Pupil Rights Amendment (PPRA) regarding surveys that request information about students' political affiliations, mental/psychological problems, sexual behavior, illegal/antisocial behavior, critical appraisals of family members, privileged relationships, religious practices, or family income. Parents/guardians have the right to inspect such surveys and opt their children out of participation.</text>\n            </required_language>\n\n            <recommended_placement>BP</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"90\">\n            <title>Missing Institutional Review Board (IRB) Requirements</title>\n            <description>Research involving human subjects, particularly minors, typically requires IRB approval to ensure ethical standards are met. The regulation lists approval criteria but doesn't address IRB requirements for research involving students, which is a standard protection for human subjects research.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>45 CFR 46 (Federal Policy for Protection of Human Subjects)</citation>\n                    <text>Research involving human subjects must be reviewed and approved by an Institutional Review Board (IRB) to ensure the rights and welfare of subjects are protected. Special protections apply to research involving children.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Research involving students as human subjects shall require appropriate Institutional Review Board (IRB) approval or equivalent ethical review. Researchers must provide evidence of such approval before district authorization will be granted.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MATERIAL\" confidence=\"85\">\n            <title>Missing Student Records Privacy Protections</title>\n            <description>The policy mentions privacy rights generally but doesn't specifically address FERPA requirements for research access to student records or the conditions under which student records may be disclosed for research purposes.</description>\n            <missing_from>BOTH</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>20 USC 1232g (FERPA) and Ed Code 49076</citation>\n                    <text>Educational records may be disclosed for research purposes only under specific conditions including that the research is conducted for or on behalf of educational agencies to develop, validate, or administer predictive tests, administer student aid programs, or improve instruction, and that personally identifiable information is destroyed when no longer needed.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Access to student records for research purposes shall comply with FERPA requirements. Researchers must agree in writing to destroy personally identifiable information when it is no longer needed for research purposes and shall not permit personal identification of students in any reports or publications.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n\n        <issue priority=\"MINOR\" confidence=\"75\">\n            <title>Missing Specific Consent Procedures</title>\n            <description>While the policy mentions that consent must be obtained \"in accordance with law,\" it doesn't specify the procedures for obtaining parental consent or student assent, timing requirements, or what information must be provided to parents.</description>\n            <missing_from>AR</missing_from>\n\n            <legal_basis>\n                <california_code>\n                    <citation>Ed Code 51513</citation>\n                    <text>Parents must receive prior written notice and have the opportunity to opt their child out of surveys requesting personal information.</text>\n                </california_code>\n            </legal_basis>\n\n            <required_language>\n                <text>Parents/guardians shall receive written notice at least [X] days prior to administration of surveys or research activities. The notice shall describe the nature of the research, type of information to be collected, and procedures for opting out. Active consent shall be required for surveys involving sensitive topics as defined by PPRA.</text>\n            </required_language>\n\n            <recommended_placement>AR</recommended_placement>\n        </issue>\n    </compliance_issues>\n</compliance_report>"
  },
  "check_date": "2025-06-01T14:34:08.878497+00:00"
}